{
  "id": "Li2024",
  "type": "article",
  "title": "GeoAI for Science and the Science of GeoAI",
  "authors": [
    "Wenwen Li",
    "Samantha T. Arundel",
    "Song Gao",
    "Michael F. Goodchild",
    "Yingjie Hu",
    "Shaowen Wang",
    "Alexander Zipf"
  ],
  "journal": {
    "name": "Journal of Spatial Information Science",
    "volume": "29",
    "pages": "1-17",
    "year": "2024"
  },
  "doi": "10.5311/JOSIS.2024.29.349",
  "url": "https://josis.org/index.php/josis/article/view/349/193",
  "abstracts": {
    "english": "This paper reviews trends in GeoAI research and discusses cutting-edge advances in GeoAI and its roles in accelerating environmental and social sciences. It addresses ongoing attempts to improve the predictability of GeoAI models and recent research aimed at increasing model explainability and reproducibility to ensure trustworthy geospatial findings. The paper also provides reflections on the importance of defining the 'science' of GeoAI in terms of its fundamental principles, theories, and methods to ensure scientific rigor, social responsibility, and lasting impacts.",
    "spanish": "Este artículo revisa las tendencias en la investigación de GeoAI y discute los avances de vanguardia en GeoAI y sus roles en la aceleración de las ciencias ambientales y sociales. Aborda los intentos continuos de mejorar la previsibilidad de los modelos de GeoAI y las investigaciones recientes destinadas a aumentar la explicabilidad y la reproducibilidad de los modelos para asegurar hallazgos geoespaciales confiables. El artículo también proporciona reflexiones sobre la importancia de definir la 'ciencia' de GeoAI en términos de sus principios fundamentales, teorías y métodos para asegurar la rigurosidad científica, la responsabilidad social y los impactos duraderos."
  },
  "license": {
    "type": "CC BY 4.0",
    "url": "https://creativecommons.org/licenses/by/4.0/",
    "description": "This license allows others to distribute, remix, adapt, and build upon this work, even commercially, as long as they credit the author for the original creation."
  },
  "notes": "Additional information or internal notes can be placed here."
}
